
## :white_check_mark: Apply Succeeded (shareable-lists-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/19177)



<pre><code>Apply complete! Resources: 10 added, 3 changed, 12 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.sqs-event-consumer_lambda_lambda-default-file_E6B572A9: Reading...
null_resource.shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B: Refreshing state... [id=6014471258794508547]
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9: Refreshing state... [id=PKR2DBQ]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A: Refreshing state... [id=P1UGDR6]
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32: Refreshing state... [id=PGEECM0]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA: Refreshing state... [id=P544E3W]
data.archive_file.sqs-event-consumer_lambda_lambda-default-file_E6B572A9: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Reading...
aws_acm_certificate.application_alb_certificate_93966247: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/4b6f50cd-5dae-4c50-95e2-2971a3b3a154]
data.aws_iam_policy_document.application_ecs_service_ecs_codedeploy_codedeploy_assume_role_C76E7224: Read complete after 0s [id=4250039221]
aws_codepipeline.shareablelistsapi_codepipeline_codepipeline_28C6CBF0: Refreshing state... [id=ShareableListsApi-Prod-CodePipeline]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0: Refreshing state... [id=shareablelistsapi-prod-app]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_ecs-task-assume_05903663: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
aws_ecs_cluster.application_ecs_cluster_4DC6EFB3: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/ShareableListsApi-Prod]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_assume_66385ECA: Read complete after 0s [id=2690255455]
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_ssm_parameter.application_pocket_vpc_private_subnets_424C83F8: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_codedeploy_app.sqs-event-consumer_lambda-code-deploy_code-deploy-app_71E01125: Refreshing state... [id=3897f2b0-8707-4f8f-bbe0-fca352c182c0:ShareableListsApi-Prod-Sqs-Event-Consumer-Lambda]
data.terraform_remote_state.incident_management: Read complete after 0s
data.aws_region.application_pocket_vpc_current_region_7774DA97: Reading...
data.aws_region.application_pocket_vpc_current_region_7774DA97: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 1s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_ssm_parameter.application_pocket_vpc_vpc_ssm_param_DD9C7A4F: Read complete after 1s [id=/Shared/Vpc]
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF: Refreshing state... [id=9f6ff8a7-12f2-4fb6-a7b0-6ae0fa50c80c:ShareableListsApi-Prod-ECS]
aws_sqs_queue.user-events-sns-subscription_sns-topic-dql_E3EC76B2: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-SNS-Topic-DLQ]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Reading...
data.aws_kms_alias.kms_alias: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_ssm_parameter.application_pocket_vpc_public_subnets_282A59F4: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_AA58E6EB: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_AA58E6EB: Read complete after 0s [id=4250039221]
data.aws_caller_identity.application_ecs_service_ecs_codedeploy_current_account_110B92B7: Read complete after 0s [id=996905175585]
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Refreshing state... [id=pocket-shareablelistsapi-prod-synthetic-checks]
aws_cloudwatch_log_group.app-log-group: Refreshing state... [id=/Backend/ShareableListsApi-Prod/ecs/app]
aws_s3_bucket.sqs-event-consumer_lambda_code-bucket_DA349A4E: Refreshing state... [id=pocket-shareablelistsapi-prod-sqs-event-consumer]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Reading...
data.aws_region.application_ecs_service_ecs_codedeploy_current_region_A377EAA5: Read complete after 0s [id=us-east-1]
data.aws_kms_alias.application_pocket_vpc_secrets_manager_key_2C3C8766: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_s3_bucket.shareablelistsapi_codepipeline_codepipelinebucket_FCB048D1: Refreshing state... [id=pocket-codepipeline-5e1253f638b8498e526f0800de4e977a]
aws_iam_role_policy.shareablelistsapi_codepipeline_codepipelinerolepolicy_0CCD3806: Refreshing state... [id=ShareableListsApi-Prod-CodePipelineRole:ShareableListsApi-Prod-CodePipeline-Role-Policy]
aws_iam_role.shareablelistsapi_codepipeline_codepipelinerole_7E4E0BE0: Refreshing state... [id=ShareableListsApi-Prod-CodePipelineRole]
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Reading...
data.aws_caller_identity.application_pocket_vpc_current_identity_0A422301: Read complete after 0s [id=996905175585]
data.aws_iam_policy_document.sqs-event-consumer_lambda_assume-policy-document_1A8910CF: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_assume-policy-document_1A8910CF: Read complete after 0s [id=1349007126]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Critical]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_execution-policy-document_B0A73C46: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=996905175585]
data.aws_iam_policy_document.sqs-event-consumer_lambda_execution-policy-document_B0A73C46: Read complete after 0s [id=2591764522]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Reading...
aws_route53_zone.application_base_dns_subhosted_zone_77521D1C: Refreshing state... [id=Z0060536173N0A80LTF4N]
aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3: Refreshing state... [id=ShareableListsApi-Prod-ECSCodeDeployRole]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7: Refreshing state... [id=shareablelistsapi-prod-app]
aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA: Refreshing state... [id=ShareableListsApi-Prod-TaskExecutionRole]
aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED: Refreshing state... [id=ShareableListsApi-Prod-TaskRole]
data.aws_vpc.pocket-vpc_2587E211: Reading...
aws_iam_role.synthetics_synthetic_check_role_A3A5C38B: Refreshing state... [id=pocket-shareablelistsapi-prod-synthetic-check]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PU01KFM]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PXZPLVP]
data.aws_vpc.application_pocket_vpc_22D55D83: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_0D24AF25: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue]
aws_iam_role.sqs-event-consumer_lambda-code-deploy_code-deploy-role_9A627C46: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-CodeDeployRole]
aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/a2f4b152e723ec2e072749a68dc6a2f39f9ffff4]
aws_s3_bucket_lifecycle_configuration.synthetics_synthetics_synthetic_check_artifacts_lifecycle_5A7B9150: Refreshing state... [id=pocket-shareablelistsapi-prod-synthetic-checks]
aws_iam_role.sqs-event-consumer_lambda_execution-role_971EF5C2: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-ExecutionRole]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_015FDEBA: Read complete after 0s [id=4054665180]
aws_s3_bucket_public_access_block.sqs-event-consumer_lambda_code-bucket-public-access-block_BB3EE815: Refreshing state... [id=pocket-shareablelistsapi-prod-sqs-event-consumer]
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Reading...
data.aws_iam_policy_document.application_ecs_service_ecs-iam_data-ecs-task-role-policy_090CC3AD: Read complete after 0s [id=2675189396]
aws_iam_policy.sqs-event-consumer_lambda_execution-policy_4069CEFE: Refreshing state... [id=arn:aws:iam::996905175585:policy/ShareableListsApi-Prod-Sqs-Event-Consumer-ExecutionRolePolicy]
data.aws_route53_zone.application_base_dns_main_hosted_zone_0141FA96: Read complete after 0s [id=Z2BHWTOWFVNW3M]
aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725: Refreshing state... [id=ShareableListsApi-Prod-ECSCodeDeployRole-2023020618400834090000000b]
data.aws_iam_policy_document.user-events-sns-subscription_sns-dlq-policy-document_ACCD2981: Reading...
data.aws_iam_policy_document.user-events-sns-subscription_sns-dlq-policy-document_ACCD2981: Read complete after 0s [id=3547599890]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF: Refreshing state... [id=ShareableListsApi-Prod-TaskExecutionRole-20230206184008125100000009]
aws_route53_record.application_alb_certificate_certificate_record_51B45CF2: Refreshing state... [id=Z0060536173N0A80LTF4N__bb46f6bf33036d9eb94adcf17a642085.shareablelistsapi.readitlater.com._CNAME]
data.aws_iam_policy_document.sqs-event-consumer_lambda_sqs_policy_D5A5EF19: Reading...
data.aws_iam_policy_document.user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6: Reading...
data.aws_iam_policy_document.sqs-event-consumer_lambda_sqs_policy_D5A5EF19: Read complete after 0s [id=322022527]
aws_sns_topic_subscription.user-events-sns-subscription_EE3E7438: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:f577c3c5-86de-474b-b8d2-db669bce4375]
data.aws_iam_policy_document.user-events-sns-subscription_sns-sqs-policy-document_6AABE7B6: Read complete after 0s [id=3384772170]
aws_iam_policy.synthetics_synthetics_synthetic_check_access_policy_9A7D8849: Refreshing state... [id=arn:aws:iam::996905175585:policy/pocket-shareablelistsapi-prod-synthetic-check-access]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77: Refreshing state... [id=arn:aws:iam::996905175585:policy/ShareableListsApi-Prod-TaskExecutionRolePolicy]
aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6: Refreshing state... [id=arn:aws:iam::996905175585:policy/ShareableListsApi-Prod-TaskRolePolicy]
aws_iam_role_policy_attachment.sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_5F4F021D: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-CodeDeployRole-20230424152508923200000002]
aws_codedeploy_deployment_group.sqs-event-consumer_lambda-code-deploy_code-deployment-group_35D3D807: Refreshing state... [id=9f282b2f-667e-4232-a3fc-9483e5699132]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-867638e3]
data.aws_vpc.application_pocket_vpc_22D55D83: Read complete after 0s [id=vpc-867638e3]
aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22: Refreshing state... [id=Z2BHWTOWFVNW3M_shareablelistsapi.readitlater.com_NS]
aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-SNS-Topic-DLQ]
aws_iam_policy.sqs-event-consumer_sqs-policy_9FE8B4E1: Refreshing state... [id=arn:aws:iam::996905175585:policy/ShareableListsApi-Prod-Sqs-Event-Consumer-LambdaSQSPolicy]
aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue]
aws_iam_role_policy_attachment.sqs-event-consumer_lambda_execution-role-policy-attachment_B4842CE7: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-ExecutionRole-20230424152508902400000001]
data.aws_vpc.redis_vpc_45DE3471: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_vpc.rds_vpc_9E5B9996: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
aws_security_group.application_application_load_balancer_alb_security_group_7B45D070: Refreshing state... [id=sg-026ed6907822b8845]
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Reading...
aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/SLAPIg20230206184007519100000007/0fa26693fa982ad1]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Reading...
data.aws_subnets.application_pocket_vpc_private_subnet_ids_AED9F181: Read complete after 0s [id=us-east-1]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Critical:bd898818-472f-4201-9b6c-035ba2562a41]
aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/SLAPIb20230206184007265200000004/24e274b59ba8b3c3]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E: Refreshing state... [id=ShareableListsApi-Prod-TaskExecutionRole-2023020618400826970000000a]
data.aws_security_groups.application_pocket_vpc_default_security_groups_4D3B6986: Read complete after 1s [id=us-east-1]
data.aws_security_groups.application_pocket_vpc_internal_security_groups_8D057D72: Read complete after 1s [id=us-east-1]
data.aws_subnets.application_pocket_vpc_public_subnet_ids_4577655C: Read complete after 1s [id=us-east-1]
data.aws_vpc.redis_vpc_45DE3471: Read complete after 1s [id=vpc-867638e3]
aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_iam_role_policy_attachment.sqs-event-consumer_execution-role-policy-attachment_2A5E0086: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-ExecutionRole-20230424152558765300000003]
aws_iam_role_policy_attachment.synthetics_synthetics_synthetic_check_access_attach_BC7F9559: Refreshing state... [id=pocket-shareablelistsapi-prod-synthetic-check-20230531140441320700000001]
aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355: Refreshing state... [id=ShareableListsApi-Prod-TaskRole-20230206184007780200000008]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical:81337390-9f19-45f4-ae0a-6bc93cb56407]
aws_elasticache_subnet_group.redis_elasticache_subnet_group_EA2B92B2: Refreshing state... [id=shareablelistsapi-prod-elasticachesubnetgroup]
aws_db_subnet_group.rds_rds_subnet_group_796D20B7: Refreshing state... [id=shareablelistsapi-prod20230207160217213400000001]
aws_lambda_function.sqs-event-consumer_lambda_477DAF53: Refreshing state... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-Function]
data.aws_vpc.rds_vpc_9E5B9996: Read complete after 1s [id=vpc-867638e3]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B: Refreshing state... [id=slapi-prod-query-0]
aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB: Refreshing state... [id=slapi-prod-uptime-0]
aws_alb.application_application_load_balancer_alb_05EA9801: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/SLAPI2023020618400918120000000c/8ac043af9d2b4fc1]
aws_security_group.application_ecs_service_ecs_security_group_231C6B1E: Refreshing state... [id=sg-0ed6d914fcfd795e1]
aws_security_group.redis_elasticache_security_group_24BFB83E: Refreshing state... [id=sg-004ca28a73e69

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

istsApi-Prod-Sqs-Event-Consumer-Queue"
        name                              = "ShareableListsApi-Prod-Sqs-Event-Consumer-Queue"
        tags                              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_sqs_queue.shareablelistsapi_sqseventconsumer_lambdasqsqueue_redrivesqsqueue_3467D4BA has moved to aws_sqs_queue.sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119
    resource "aws_sqs_queue" "sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_CCE99119" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue-Deadletter"
        name                              = "ShareableListsApi-Prod-Sqs-Event-Consumer-Queue-Deadletter"
        tags                              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.shareablelistsapi_usereventssnssubscription_snstopicdql_635CB492 has moved to aws_sqs_queue.user-events-sns-subscription_sns-topic-dql_E3EC76B2
    resource "aws_sqs_queue" "user-events-sns-subscription_sns-topic-dql_E3EC76B2" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-SNS-Topic-DLQ"
        name                              = "ShareableListsApi-Prod-SNS-Topic-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.shareablelistsapi_usereventssnssubscription_snsdlqpolicy_A97C45D7 has moved to aws_sqs_queue_policy.user-events-sns-subscription_sns-dlq-policy_CF731C06
    resource "aws_sqs_queue_policy" "user-events-sns-subscription_sns-dlq-policy_CF731C06" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-SNS-Topic-DLQ"
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.shareablelistsapi_usereventssnssubscription_snssqspolicy_31AE2D11 has moved to aws_sqs_queue_policy.user-events-sns-subscription_sns-sqs-policy_C14BCCA0
    resource "aws_sqs_queue_policy" "user-events-sns-subscription_sns-sqs-policy_C14BCCA0" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/ShareableListsApi-Prod-Sqs-Event-Consumer-Queue"
        # (2 unchanged attributes hidden)
    }

  # aws_synthetics_canary.shareablelistsapi_synthetics_syntheticssyntheticcheckquery0_0DF36B9C has moved to aws_synthetics_canary.synthetics_synthetics_synthetic_check_query_0_99E4AE1B
    resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_query_0_99E4AE1B" {
        id                       = "slapi-prod-query-0"
        name                     = "slapi-prod-query-0"
        tags                     = {}
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_synthetics_canary.shareablelistsapi_synthetics_syntheticssyntheticcheckuptime0_5C8C5503 has moved to aws_synthetics_canary.synthetics_synthetics_synthetic_check_uptime_0_4168D0DB
    resource "aws_synthetics_canary" "synthetics_synthetics_synthetic_check_uptime_0_4168D0DB" {
        id                       = "slapi-prod-uptime-0"
        name                     = "slapi-prod-uptime-0"
        tags                     = {}
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  # (moved from local_file.shareablelistsapi_application_ecsservice_appspec_2626BE67)
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B will be destroyed
  # (because null_resource.shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B is not in configuration)
  - resource "null_resource" "shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B" {
      - id       = "6014471258794508547" -> null
      - triggers = {
          - "alwaysRun" = "2023-10-05T02:19:22Z"
        } -> null
    }

  # pagerduty_service.shareablelistsapi_pagerduty_pagerdutycritical_CA569663 has moved to pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
    resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
        id                      = "PXZPLVP"
        name                    = "ShareableListsApi-Prod-PagerDuty-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.shareablelistsapi_pagerduty_pagerdutynoncritical_F5BDD663 has moved to pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
    resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
        id                      = "PU01KFM"
        name                    = "ShareableListsApi-Prod-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PXZPLVP"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PU01KFM"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PXZPLVP"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PU01KFM"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA will be destroyed
  # (because pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA is not in configuration)
  - resource "pagerduty_service_integration" "shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA" {
      - html_url        = "https://mozilla.pagerduty.com/services/PXZPLVP/integrations/P544E3W" -> null
      - id              = "P544E3W" -> null
      - integration_key = "6a161f4866d94f0ac0693ed1606d85fb" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PXZPLVP" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32 will be destroyed
  # (because pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32 is not in configuration)
  - resource "pagerduty_service_integration" "shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32" {
      - html_url        = "https://mozilla.pagerduty.com/services/PU01KFM/integrations/PGEECM0" -> null
      - id              = "PGEECM0" -> null
      - integration_key = "5e2a35d281564703d04ee956892d1e07" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PU01KFM" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A will be destroyed
  # (because pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A is not in configuration)
  - resource "pagerduty_service_integration" "shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A" {
      - html_url        = "https://mozilla.pagerduty.com/services/PXZPLVP/integrations/P1UGDR6" -> null
      - id              = "P1UGDR6" -> null
      - integration_key = "c9450bd5c1b14a01d0c359e1ef5fb1fc" -> null
      - name            = "Sentry" -> null
      - service         = "PXZPLVP" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9 will be destroyed
  # (because pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9 is not in configuration)
  - resource "pagerduty_service_integration" "shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9" {
      - html_url        = "https://mozilla.pagerduty.com/services/PU01KFM/integrations/PKR2DBQ" -> null
      - id              = "PKR2DBQ" -> null
      - integration_key = "c43bc0062e3c4a0cc01e5eeacdde84a3" -> null
      - name            = "Sentry" -> null
      - service         = "PU01KFM" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

Plan: 10 to add, 4 to change, 12 to destroy.
null_resource.shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B: Destroying... [id=6014471258794508547]
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9: Destroying... [id=PKR2DBQ]
null_resource.shareablelistsapi_application_ecsservice_createtaskdefinitionfile_3E3BD94B: Destruction complete after 0s
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A: Destroying... [id=P1UGDR6]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destroying... [id=ShareableListsApi-Prod]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destroying... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical:81337390-9f19-45f4-ae0a-6bc93cb56407]
aws_iam_role_policy.shareablelistsapi_codepipeline_codepipelinerolepolicy_0CCD3806: Destroying... [id=ShareableListsApi-Prod-CodePipelineRole:ShareableListsApi-Prod-CodePipeline-Role-Policy]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Critical:bd898818-472f-4201-9b6c-035ba2562a41]
aws_s3_bucket_ownership_controls.sqs-event-consumer_lambda_code-bucket-ownership-controls_E3CCA008: Creating...
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Modifying... [id=pocket-shareablelistsapi-prod-synthetic-checks]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Destruction complete after 0s
aws_codepipeline.shareablelistsapi_codepipeline_codepipeline_28C6CBF0: Destroying... [id=ShareableListsApi-Prod-CodePipeline]
aws_iam_role_policy.shareablelistsapi_codepipeline_codepipelinerolepolicy_0CCD3806: Destruction complete after 0s
aws_lambda_function.sqs-event-consumer_lambda_477DAF53: Modifying... [id=ShareableListsApi-Prod-Sqs-Event-Consumer-Function]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destruction complete after 0s
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32: Destroying... [id=PGEECM0]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 0s
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
aws_s3_bucket.synthetics_synthetics_synthetic_check_artifacts_53DD59E6: Modifications complete after 0s [id=pocket-shareablelistsapi-prod-synthetic-checks]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
aws_codepipeline.shareablelistsapi_codepipeline_codepipeline_28C6CBF0: Destruction complete after 0s
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA: Destroying... [id=P544E3W]
aws_s3_bucket_ownership_controls.sqs-event-consumer_lambda_code-bucket-ownership-controls_E3CCA008: Creation complete after 0s [id=pocket-shareablelistsapi-prod-sqs-event-consumer]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creating...
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAnoncritical_24D72AE9: Destruction complete after 0s
aws_s3_bucket.shareablelistsapi_codepipeline_codepipelinebucket_FCB048D1: Destroying... [id=pocket-codepipeline-5e1253f638b8498e526f0800de4e977a]
aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4: Creation complete after 0s [id=ShareableListsApi-Prod]
aws_iam_role.shareablelistsapi_codepipeline_codepipelinerole_7E4E0BE0: Destroying... [id=ShareableListsApi-Prod-CodePipelineRole]
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutysentryF8EA21CAcritical_E3A8B99A: Destruction complete after 0s
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Reading...
data.aws_iam_policy_document.synthetics_synthetics_synthetic_check_access_4C83FECF: Read complete after 0s [id=2678327256]
aws_s3_bucket_acl.sqs-event-consumer_lambda_code-bucket-acl_8FA13E85: Creating...
aws_iam_role.shareablelistsapi_codepipeline_codepipelinerole_7E4E0BE0: Destruction complete after 0s
local_file.application_ecs_service_appspec_94386B9C: Creating...
local_file.application_ecs_service_appspec_94386B9C: Creation complete after 0s [id=0ca0c23654508361d7fc16c662b6ead4e8901596]
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Modifying... [id=service/ShareableListsApi-Prod/ShareableListsApi-Prod]
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4noncritical_44B23D32: Destruction complete after 0s
aws_s3_bucket_acl.sqs-event-consumer_lambda_code-bucket-acl_8FA13E85: Creation complete after 0s [id=pocket-shareablelistsapi-prod-sqs-event-consumer,private]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 0s [id=PSRN8C1]
pagerduty_service_integration.shareablelistsapi_pagerduty_shareablelistsapipagerdutycloudwatch5B0612B4critical_CB12E4FA: Destruction complete after 0s
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 0s [id=POEM7MB]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 1s [id=P4WQ6XL]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 1s [id=P85B7NO]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99: Modifications complete after 1s [id=service/ShareableListsApi-Prod/ShareableListsApi-Prod]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 0s [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Critical:50ebe021-2a5a-4c67-afbc-574cd81d65ba]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 0s [id=arn:aws:sns:us-east-1:996905175585:ShareableListsApi-Prod-Infrastructure-Alarm-Non-Critical:7c4736e6-9b8f-4dd8-a9f7-17f57aa3cb8a]
aws_s3_bucket.shareablelistsapi_codepipeline_codepipelinebucket_FCB048D1: Destruction complete after 2s
aws_lambda_function.sqs-event-consumer_lambda_477DAF53: Modifications complete after 7s [id=ShareableListsApi-Prod-Sqs-Event-Consumer-Function]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 3041, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 3041:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵
Releasing state lock. This may take a few moments...

Apply complete! Resources: 10 added, 3 changed, 12 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"7a062bbd-ca7d-4e35-ac42-7cb6324e3147","JobName":"shareable-lists-api_infrastructure_apply_prod","PRNumber":84,"Program":"tfcmt","SHA1":"03f2dc7c24b82ea5455f7fd95b3302bdbfdc8848","Target":"shareable-lists-api-cdk","Vars":{}} -->